content/lectures/standard_template_libaray.md
+++
title = "Standard Template Library"
draft = false
weight = 4
date = 2022-08-22
publishdate = 2022-07-01
+++

Today we will discuss the standard template library for C++.  You don't have to use this for your own
programming, but we will use it in our examples so you should know how it all works.

We will cover:

-   C-Style arrays
-   Vectors
-   Pairs
-   Stacks and Queues
-   Maps and Sets

We will not cover `priority_queue`, but you may want to look at those as well on your own.


## Slides {#slides}

-   [STL Slides](/slides/standard-template-library.pdf)
